Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain_redirects["www_broadinstitute_org"].google_compute_global_address.public_address must be replaced
-/+ resource "google_compute_global_address" "public_address" {
!       address            = "34.8.40.120" -> (known after apply)
-       address_type       = "EXTERNAL" -> null
!       creation_timestamp = "2025-07-21T12:04:41.263-07:00" -> (known after apply)
!       id                 = "projects/broad-redirect-prod/global/addresses/www-broadinstitute-mobi-public-address" -> (known after apply)
!       label_fingerprint  = "vezUS-42LLM=" -> (known after apply)
-       labels             = {} -> null
!       name               = "www-broadinstitute-mobi-public-address" -> "broadinstitute-org-public-address" # forces replacement
!       prefix_length      = 0 -> (known after apply)
!       self_link          = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/addresses/www-broadinstitute-mobi-public-address" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_global_forwarding_rule.global_forwarding_http_rule must be replaced
-/+ resource "google_compute_global_forwarding_rule" "global_forwarding_http_rule" {
+       base_forwarding_rule                                         = (known after apply)
!       effective_labels                                             = {} -> (known after apply)
-       external_managed_backend_bucket_migration_testing_percentage = 0 -> null
!       forwarding_rule_id                                           = 57953156433392048 -> (known after apply)
!       id                                                           = "projects/broad-redirect-prod/global/forwardingRules/www-broadinstitute-mobi-global-forwarding-http-rule" -> (known after apply)
!       ip_address                                                   = "34.8.40.120" -> (known after apply)
!       ip_protocol                                                  = "TCP" -> (known after apply)
!       label_fingerprint                                            = "42WmSpB8rSM=" -> (known after apply)
-       labels                                                       = {} -> null
!       name                                                         = "www-broadinstitute-mobi-global-forwarding-http-rule" -> "broadinstitute-org-global-forwarding-http-rule" # forces replacement
+       network                                                      = (known after apply)
!       network_tier                                                 = "PREMIUM" -> (known after apply)
!       port_range                                                   = "80-80" -> "80"
+       psc_connection_id                                            = (known after apply)
+       psc_connection_status                                        = (known after apply)
!       self_link                                                    = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/forwardingRules/www-broadinstitute-mobi-global-forwarding-http-rule" -> (known after apply)
-       source_ip_ranges                                             = [] -> null
+       subnetwork                                                   = (known after apply)
!       target                                                       = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/targetHttpProxies/www-broadinstitute-mobi-http-proxy" -> (known after apply)
!       terraform_labels                                             = {} -> (known after apply)
        # (5 unchanged attributes hidden)

!       service_directory_registrations (known after apply)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_global_forwarding_rule.global_forwarding_https_rule must be replaced
-/+ resource "google_compute_global_forwarding_rule" "global_forwarding_https_rule" {
+       base_forwarding_rule                                         = (known after apply)
!       effective_labels                                             = {} -> (known after apply)
-       external_managed_backend_bucket_migration_testing_percentage = 0 -> null
!       forwarding_rule_id                                           = 5537575155403010447 -> (known after apply)
!       id                                                           = "projects/broad-redirect-prod/global/forwardingRules/www-broadinstitute-mobi-global-forwarding-https-rule" -> (known after apply)
!       ip_address                                                   = "34.8.40.120" -> (known after apply)
!       ip_protocol                                                  = "TCP" -> (known after apply)
!       label_fingerprint                                            = "42WmSpB8rSM=" -> (known after apply)
-       labels                                                       = {} -> null
!       name                                                         = "www-broadinstitute-mobi-global-forwarding-https-rule" -> "broadinstitute-org-global-forwarding-https-rule" # forces replacement
+       network                                                      = (known after apply)
!       network_tier                                                 = "PREMIUM" -> (known after apply)
!       port_range                                                   = "443-443" -> "443"
+       psc_connection_id                                            = (known after apply)
+       psc_connection_status                                        = (known after apply)
!       self_link                                                    = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/forwardingRules/www-broadinstitute-mobi-global-forwarding-https-rule" -> (known after apply)
-       source_ip_ranges                                             = [] -> null
+       subnetwork                                                   = (known after apply)
!       target                                                       = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/targetHttpsProxies/www-broadinstitute-mobi-https-proxy" -> (known after apply)
!       terraform_labels                                             = {} -> (known after apply)
        # (5 unchanged attributes hidden)

!       service_directory_registrations (known after apply)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_managed_ssl_certificate.certificate must be replaced
-/+ resource "google_compute_managed_ssl_certificate" "certificate" {
!       certificate_id            = 8184773914670608807 -> (known after apply)
!       creation_timestamp        = "2025-07-21T12:04:41.214-07:00" -> (known after apply)
!       expire_time               = "2025-10-19T17:24:15.000-07:00" -> (known after apply)
!       id                        = "projects/broad-redirect-prod/global/sslCertificates/www-broadinstitute-mobi-managed-certificate" -> (known after apply)
!       name                      = "www-broadinstitute-mobi-managed-certificate" -> "broadinstitute-org-managed-certificate" # forces replacement
!       self_link                 = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/sslCertificates/www-broadinstitute-mobi-managed-certificate" -> (known after apply)
!       subject_alternative_names = [
-           "www.broadinstitute.mobi",
-           "broadinstitute.mobi",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

!       managed {
!           domains = [ # forces replacement
-               "www.broadinstitute.mobi",
+               "broadinstitute.org",
+               "broadinsitute.org",
+               "broadinstittute.org",
+               "broadinstitute-mit.org",
+               "broadintitute.com",
+               "broadintitute.org",
+               "broadlinstitute.com",
+               "broadlinstitute.net",
+               "broadlinstitute.org",
+               "broadlnstitute.com",
+               "broadlnstitute.net",
+               "broadlnstitute.org",
+               "broadlntitute.org",
+               "broadnstitute.org",
+               "broad.dev",
+               "broad.im",
+               "broad.institute",
+               "broad.us",
+               "broadapis.org",
+               "broadapps.com",
+               "broadapps.net",
+               "broadapps.org",
+               "broadinstitute.com",
+               "broadinstitute.info",
                "broadinstitute.mobi",
+               "broadinstitute.net",
+               "broadinstitute.tv",
+               "broadinstitute.us",
+               "redirect.broadinstitute.org",
+               "test.broadinstitute.com",
+               "test.broadinstitute.net",
+               "test.broadinstitute.org",
+               "thebroadinstitute.com",
+               "thebroadinstitute.info",
+               "thebroadinstitute.net",
+               "thebroadinstitute.org",
+               "thebroadinstitute.us",
            ]
        }
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_target_http_proxy.http_proxy must be replaced
-/+ resource "google_compute_target_http_proxy" "http_proxy" {
!       creation_timestamp          = "2025-07-21T12:04:52.508-07:00" -> (known after apply)
!       fingerprint                 = "yfovfpcGNec=" -> (known after apply)
-       http_keep_alive_timeout_sec = 0 -> null
!       id                          = "projects/broad-redirect-prod/global/targetHttpProxies/www-broadinstitute-mobi-http-proxy" -> (known after apply)
!       name                        = "www-broadinstitute-mobi-http-proxy" -> "broadinstitute-org-http-proxy" # forces replacement
!       proxy_bind                  = false -> (known after apply)
!       proxy_id                    = 3438765529954988475 -> (known after apply)
!       self_link                   = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/targetHttpProxies/www-broadinstitute-mobi-http-proxy" -> (known after apply)
!       url_map                     = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-to-http-url-map" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_target_https_proxy.https_proxy must be replaced
-/+ resource "google_compute_target_https_proxy" "https_proxy" {
-       certificate_manager_certificates = [] -> null
!       creation_timestamp               = "2025-07-21T12:04:52.938-07:00" -> (known after apply)
!       fingerprint                      = "JY8rgULTG9o=" -> (known after apply)
-       http_keep_alive_timeout_sec      = 0 -> null
!       id                               = "projects/broad-redirect-prod/global/targetHttpsProxies/www-broadinstitute-mobi-https-proxy" -> (known after apply)
!       name                             = "www-broadinstitute-mobi-https-proxy" -> "broadinstitute-org-https-proxy" # forces replacement
!       proxy_bind                       = false -> (known after apply)
!       proxy_id                         = 1379335119614194107 -> (known after apply)
!       self_link                        = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/targetHttpsProxies/www-broadinstitute-mobi-https-proxy" -> (known after apply)
!       ssl_certificates                 = [
-           "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/sslCertificates/www-broadinstitute-mobi-managed-certificate",
        ] -> (known after apply)
!       tls_early_data                   = "DISABLED" -> (known after apply)
!       url_map                          = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-https-url-map" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_url_map.http_url_map must be replaced
-/+ resource "google_compute_url_map" "http_url_map" {
!       creation_timestamp = "2025-07-21T12:04:41.365-07:00" -> (known after apply)
!       fingerprint        = "b73fiVU6J5M=" -> (known after apply)
!       id                 = "projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-to-http-url-map" -> (known after apply)
!       map_id             = 8679677223752642982 -> (known after apply)
!       name               = "www-broadinstitute-mobi-to-http-url-map" -> "broadinstitute-org-to-http-url-map" # forces replacement
!       self_link          = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-to-http-url-map" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.domain_redirects["www_broadinstitute_org"].google_compute_url_map.https_url_map must be replaced
-/+ resource "google_compute_url_map" "https_url_map" {
!       creation_timestamp = "2025-07-21T12:04:41.399-07:00" -> (known after apply)
!       fingerprint        = "SGcYAgSYsUY=" -> (known after apply)
!       id                 = "projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-https-url-map" -> (known after apply)
!       map_id             = 7377377920527053222 -> (known after apply)
!       name               = "www-broadinstitute-mobi-https-url-map" -> "broadinstitute-org-https-url-map" # forces replacement
!       self_link          = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/urlMaps/www-broadinstitute-mobi-https-url-map" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 8 to add, 0 to change, 8 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```